HuangShW/mymatter/esp32/main/main.cpp
// 删除
Protocols::InteractionModel::Status HandleReadOnOffAttribute(Device * dev, chip::AttributeId attributeId, uint8_t * buffer,
                                                             uint16_t maxReadLength)
{
    ChipLogProgress(DeviceLayer, "HandleReadOnOffAttribute: attrId=%" PRIu32 ", maxReadLength=%u", attributeId, maxReadLength);

    if ((attributeId == OnOff::Attributes::OnOff::Id) && (maxReadLength == 1))
    {
        *buffer = dev->IsOn() ? 1 : 0;
    }
    else if ((attributeId == OnOff::Attributes::ClusterRevision::Id) && (maxReadLength == 2))
    {
        uint16_t rev = ZCL_ON_OFF_CLUSTER_REVISION;
        memcpy(buffer, &rev, sizeof(rev));
    }
    else
    {
        return Protocols::InteractionModel::Status::Failure;
    }

    return Protocols::InteractionModel::Status::Success;
}

// 删除
Protocols::InteractionModel::Status HandleWriteOnOffAttribute(Device * dev, chip::AttributeId attributeId, uint8_t * buffer)
{
    ChipLogProgress(DeviceLayer, "HandleWriteOnOffAttribute: attrId=%" PRIu32, attributeId);

    VerifyOrReturnError((attributeId == OnOff::Attributes::OnOff::Id) && dev->IsReachable(),
                        Protocols::InteractionModel::Status::Failure);
    dev->SetOnOff(*buffer == 1);
    return Protocols::InteractionModel::Status::Success;
}
//新增
// Protocols::InteractionModel::Status HandleReadThermostatAttribute(Device * dev, chip::AttributeId attributeId, uint8_t * buffer,
//     uint16_t maxReadLength)
// {
//     ESP_LOGI(TAG, "HandleReadThermostatAttribute: attrId=%" PRIu32 ", maxReadLength=%u", attributeId, maxReadLength);

//     switch (attributeId) {
//         case Thermostat::Attributes::LocalTemperature::Id:
//         if (maxReadLength >= 2) {
//             int16_t temp = 2500; // 25°C
//             memcpy(buffer, &temp, sizeof(temp));
//             return Protocols::InteractionModel::Status::Success;
//         }
//         break;

//         case  Thermostat::Attributes::OccupiedCoolingSetpoint::Id:
//         if (maxReadLength >= 2) {
//             int16_t setpoint = 2200; // 22°C
//             memcpy(buffer, &setpoint, sizeof(setpoint));
//             return Protocols::InteractionModel::Status::Success;
//         }
//         break;

//         case  Thermostat::Attributes::SystemMode::Id:
//         if (maxReadLength >= 1) {
//             *buffer = 1; // Cool mode
//             return Protocols::InteractionModel::Status::Success;
//         }
//         break;

//         case  Thermostat::Attributes::ThermostatRunningMode::Id:
//         if (maxReadLength >= 1) {
//             *buffer = 1; // Running
//             return Protocols::InteractionModel::Status::Success;
//         }
//         break;

//         case  Thermostat::Attributes::HVACSystemTypeConfiguration::Id:
//         if (maxReadLength >= 1) {
//             *buffer = 1; // Cooling system
//             return Protocols::InteractionModel::Status::Success;
//         }
//         break;

//         case Thermostat::Attributes::FeatureMap::Id:
//         if (maxReadLength >= 1) {  // BITMAP32 需要 4 字节
//             uint32_t featureMapValue = 0x03;  // 支持功能位（例如 bit 0 和 bit 1）
//             memcpy(buffer, &featureMapValue, sizeof(featureMapValue));
//             return Protocols::InteractionModel::Status::Success;
//         }
//         break;

//         case  Thermostat::Attributes::ClusterRevision::Id:
//         if (maxReadLength >= 2) {
//             uint16_t rev = 4; // ZCL Thermostat cluster revision
//             memcpy(buffer, &rev, sizeof(rev));
//             return Protocols::InteractionModel::Status::Success;
//         }
//         break;

//     }
//     ESP_LOGE(TAG, "Unhandled Thermostat attribute: 0x%lX", attributeId);
//     return Protocols::InteractionModel::Status::Failure;
// }

//读开关状态，状态上报
Protocols::InteractionModel::Status emberAfExternalAttributeReadCallback(EndpointId endpoint, ClusterId clusterId,
                                                                         const EmberAfAttributeMetadata * attributeMetadata,
                                                                         uint8_t * buffer, uint16_t maxReadLength)
{
    uint16_t endpointIndex = emberAfGetDynamicIndexFromEndpoint(endpoint);

    if ((endpointIndex < CHIP_DEVICE_CONFIG_DYNAMIC_ENDPOINT_COUNT) && (gDevices[endpointIndex] != NULL))
    {
        Device * dev = gDevices[endpointIndex];

        if (clusterId == BridgedDeviceBasicInformation::Id)
        {
            return HandleReadBridgedDeviceBasicAttribute(dev, attributeMetadata->attributeId, buffer, maxReadLength);
        }
        else if (clusterId == OnOff::Id)
        {
            return HandleReadOnOffAttribute(dev, attributeMetadata->attributeId, buffer, maxReadLength);
        }
    }

    return Protocols::InteractionModel::Status::Failure;
}

//控制开关状态
// 删除
Protocols::InteractionModel::Status emberAfExternalAttributeWriteCallback(EndpointId endpoint, ClusterId clusterId,
                                                                          const EmberAfAttributeMetadata * attributeMetadata,
                                                                          uint8_t * buffer)
{
    uint16_t endpointIndex = emberAfGetDynamicIndexFromEndpoint(endpoint);

    if (endpointIndex < CHIP_DEVICE_CONFIG_DYNAMIC_ENDPOINT_COUNT)
    {
        Device * dev = gDevices[endpointIndex];

        if ((dev->IsReachable()) && (clusterId == OnOff::Id))
        {
            return HandleWriteOnOffAttribute(dev, attributeMetadata->attributeId, buffer);
        }
    }

    return Protocols::InteractionModel::Status::Failure;
}

namespace {
void CallReportingCallback(intptr_t closure)
{
    auto path = reinterpret_cast<app::ConcreteAttributePath *>(closure);
    MatterReportingAttributeChangeCallback(*path);
    Platform::Delete(path);
}

void ScheduleReportingCallback(Device * dev, ClusterId cluster, AttributeId attribute)
{
    auto * path = Platform::New<app::ConcreteAttributePath>(dev->GetEndpointId(), cluster, attribute);
    DeviceLayer::PlatformMgr().ScheduleWork(CallReportingCallback, reinterpret_cast<intptr_t>(path));
}
} // anonymous namespace

void HandleDeviceStatusChanged(Device * dev, Device::Changed_t itemChangedMask)
{
    if (itemChangedMask & Device::kChanged_Reachable)
    {
        ScheduleReportingCallback(dev, BridgedDeviceBasicInformation::Id, BridgedDeviceBasicInformation::Attributes::Reachable::Id);
    }

    if (itemChangedMask & Device::kChanged_State)
    {
        ScheduleReportingCallback(dev, OnOff::Id, OnOff::Attributes::OnOff::Id);
    }

    if (itemChangedMask & Device::kChanged_Name)
    {
        ScheduleReportingCallback(dev, BridgedDeviceBasicInformation::Id, BridgedDeviceBasicInformation::Attributes::NodeLabel::Id);
    }
}

